[
  {
    "id": "access_to_education",
    "name": "Access to Education",
    "description": "Policies determining how refugee children access the education system",
    "options": [
      {
        "id": "access_opt1",
        "title": "Limited Access",
        "description": "Limit access to education for refugees, allowing only a small percentage to enroll in mainstream schools. This prioritizes resources for citizens but excludes many refugee children from quality education, hindering their future prospects.",
        "cost": 1,
        "domain": "access_to_education"
      },
      {
        "id": "access_opt2",
        "title": "Separate Schools",
        "description": "Establish separate schools or learning centers specifically for refugee education. This provides dedicated education considering their unique needs but may foster segregation and limit integration opportunities.",
        "cost": 2,
        "domain": "access_to_education"
      },
      {
        "id": "access_opt3",
        "title": "Full Integration",
        "description": "Provide equal access to education for all, integrating refugee students into mainstream schools. This promotes integration and social cohesion but requires additional resources and support systems.",
        "cost": 3,
        "domain": "access_to_education"
      }
    ]
  },
  {
    "id": "language_instruction",
    "name": "Language Instruction",
    "description": "Policies on language teaching approaches for refugee students",
    "options": [
      {
        "id": "lang_opt1",
        "title": "Teanish Only",
        "description": "Maintain the current policy of teaching only Teanish in schools, excluding other languages. This preserves linguistic unity but hinders effective communication and integration of refugee students.",
        "cost": 1,
        "domain": "language_instruction"
      },
      {
        "id": "lang_opt2",
        "title": "Basic Teanish Courses",
        "description": "Provide primary Teanish language courses to refugees, enabling them to access essential services. This offers minimum language proficiency but limits broader educational opportunities.",
        "cost": 2,
        "domain": "language_instruction"
      },
      {
        "id": "lang_opt3",
        "title": "Bilingual Education",
        "description": "Implement comprehensive bilingual education programs in both Teanish and the mother tongue of refugees. This facilitates better communication and cultural identity preservation but requires more resources.",
        "cost": 3,
        "domain": "language_instruction"
      }
    ]
  },
  {
    "id": "teacher_training",
    "name": "Teacher Training",
    "description": "Policies on preparing teachers to work with refugee students",
    "options": [
      {
        "id": "teacher_opt1",
        "title": "Minimal Training",
        "description": "Provide minimal or no specific training for teachers regarding refugee education. This requires fewer resources but limits teachers' ability to address the unique needs of refugee students.",
        "cost": 1,
        "domain": "teacher_training"
      },
      {
        "id": "teacher_opt2",
        "title": "Basic Training",
        "description": "Offer basic training sessions for teachers to familiarize them with the challenges and needs of refugee students. This provides foundational understanding but may not fully equip teachers for complex challenges.",
        "cost": 2,
        "domain": "teacher_training"
      },
      {
        "id": "teacher_opt3",
        "title": "Comprehensive Training",
        "description": "Implement comprehensive ongoing training programs for teachers to effectively support refugee students. This enhances teachers' capacity but requires substantial investment in professional development.",
        "cost": 3,
        "domain": "teacher_training"
      }
    ]
  },
  {
    "id": "curriculum_adaptation",
    "name": "Curriculum Adaptation",
    "description": "Policies on adapting educational content for diverse student populations",
    "options": [
      {
        "id": "curr_opt1",
        "title": "Standard Curriculum",
        "description": "Maintain the existing national curriculum without modifications. This preserves continuity but neglects inclusion of refugee experiences and cultural diversity.",
        "cost": 1,
        "domain": "curriculum_adaptation"
      },
      {
        "id": "curr_opt2",
        "title": "Supplementary Materials",
        "description": "Introduce supplementary materials that acknowledge the experiences of refugees while following the mainstream curriculum. This provides some recognition but may not fully address specific educational needs.",
        "cost": 2,
        "domain": "curriculum_adaptation"
      },
      {
        "id": "curr_opt3",
        "title": "Inclusive Curriculum",
        "description": "Adapt the national curriculum to include diverse perspectives, histories, and cultural elements relevant to both citizens and refugees. This promotes mutual understanding but requires substantial redesign.",
        "cost": 3,
        "domain": "curriculum_adaptation"
      }
    ]
  },
  {
    "id": "psychosocial_support",
    "name": "Psychosocial Support",
    "description": "Policies addressing the mental health and emotional needs of refugee students",
    "options": [
      {
        "id": "psych_opt1",
        "title": "Minimal Support",
        "description": "Provide limited or no specific psychosocial support for refugee students. This reduces immediate resource burdens but negatively impacts mental health and educational success.",
        "cost": 1,
        "domain": "psychosocial_support"
      },
      {
        "id": "psych_opt2",
        "title": "Basic Counseling",
        "description": "Establish basic support services such as counseling and peer support programs. This provides some assistance for psychosocial challenges but requires trained personnel.",
        "cost": 2,
        "domain": "psychosocial_support"
      },
      {
        "id": "psych_opt3",
        "title": "Comprehensive Support",
        "description": "Develop specialized psychosocial support programs offering tailored assistance to refugee students and families. This prioritizes mental health and integration but requires significant investment.",
        "cost": 3,
        "domain": "psychosocial_support"
      }
    ]
  },
  {
    "id": "financial_support",
    "name": "Financial Support",
    "description": "Policies on funding allocations for refugee education programs",
    "options": [
      {
        "id": "fin_opt1",
        "title": "Minimal Funding",
        "description": "Allocate minimal funds to support refugee education. This minimizes financial burden on the government but limits educational quality and accessibility.",
        "cost": 1,
        "domain": "financial_support"
      },
      {
        "id": "fin_opt2",
        "title": "Moderate Funding",
        "description": "Increase financial support for refugee education, though still insufficient to meet all needs. This provides additional resources but may not address all financial complexities.",
        "cost": 2,
        "domain": "financial_support"
      },
      {
        "id": "fin_opt3",
        "title": "Comprehensive Funding",
        "description": "Allocate significant financial resources to ensure adequate funding for refugee education. This enables high-quality support services but requires substantial budget commitment.",
        "cost": 3,
        "domain": "financial_support"
      }
    ]
  },
  {
    "id": "certification",
    "name": "Educational Certification",
    "description": "Policies on recognizing previous educational qualifications of refugees",
    "options": [
      {
        "id": "cert_opt1",
        "title": "Local Recognition Only",
        "description": "Only recognize educational qualifications obtained within the Republic of Bean. This simplifies accreditation but disregards valuable prior learning, hindering integration and employment.",
        "cost": 1,
        "domain": "certification"
      },
      {
        "id": "cert_opt2",
        "title": "Universal Standards",
        "description": "Establish a comprehensive evaluation process for certification of previous educational experiences. This recognizes prior achievements but requires resources to evaluate diverse backgrounds.",
        "cost": 2,
        "domain": "certification"
      },
      {
        "id": "cert_opt3",
        "title": "Tailored Programs",
        "description": "Develop programs that combine recognition of previous education with additional training to ensure alignment with national standards. This provides flexible pathways but requires coordination.",
        "cost": 3,
        "domain": "certification"
      }
    ]
  }
]